test/artillery/flow/config.yaml
config:
  pluggins:
    metrics-by-endpoint : {}
  target: http://localhost:8080/api
  phases:
    - duration: 2
      arrivalRate: 10
scenarios:
  - name: login, create & read a product & singout
    flow:
      - log: CREATE PRODUCT
      - post:
          url: /products
          json:
            title: producto prueba
          capture:
            - json: "$.response._id"
              as: "pid"
      - log: GET PRODUCT
      - get:
          url: /products/{{pid}}